#include "meta.h"
#include "../layout/layout.h"
#include "../coding/coding.h"
#include "../util/endianness.h"


/* If these variables are packed properly in the struct (one after another)
 * then this is actually how they are laid out in the file, albeit big-endian */
typedef struct {
    uint32_t sample_count;      /* 0x00 */
    uint32_t nibble_count;      /* 0x04 (includes frame headers) */
    uint32_t sample_rate;       /* 0x08 (generally 22/32/44/48kz but games like Wario World set 32028hz to adjust for GC's rate) */
    uint16_t loop_flag;         /* 0x0c */
    uint16_t format;            /* 0x0e (always 0 for ADPCM) */
    uint32_t loop_start_offset; /* 0x10 (in nibbles, should be 2 if 0/not set) */
    uint32_t loop_end_offset;   /* 0x14 (in nibbles) */
    uint32_t initial_offset;    /* 0x18 ("ca", in nibbles, should be 2) */
    int16_t coef[16];           /* 0x1c (eight pairs) */
    uint16_t gain;              /* 0x3c (always 0 for ADPCM) */
    uint16_t initial_ps;        /* 0x3e (predictor/scale in frame header) */
    int16_t initial_hist1;      /* 0x40 */
    int16_t initial_hist2;      /* 0x42 */
    uint16_t loop_ps;           /* 0x44 (predictor/scale in loop frame header) */
    int16_t loop_hist1;         /* 0x46 */
    int16_t loop_hist2;         /* 0x48 */
    int16_t channels;           /* 0x4a (DSPADPCM.exe ~v2.7 extension) */
    uint16_t block_size;        /* 0x4c */
    /* padding/reserved up to 0x60, DSPADPCM.exe from GC adds garbage here (uninitialized MSVC memory?)
     * [ex. Batallion Wars (GC), Timesplitters 2 (GC)], 0xcccc...cccc with DSPADPCMD */
} dsp_header_t;

typedef struct {
    bool ignore_null_coefs;         /* silent files in rare cases */
} dsp_header_config_t;

/* read and do basic validations to the above struct */
static bool read_dsp_header_endian(dsp_header_t* header, off_t offset, STREAMFILE* sf, bool big_endian, dsp_header_config_t* cfg) {
    get_u32_t get_u32 = big_endian ? get_u32be : get_u32le;
    get_u16_t get_u16 = big_endian ? get_u16be : get_u16le;
    get_s16_t get_s16 = big_endian ? get_s16be : get_s16le;
    uint8_t buf[0x60];
    int zero_coefs;

    if (offset > get_streamfile_size(sf))
        goto fail;
    if (read_streamfile(buf, offset, 0x60, sf) != 0x60)
        goto fail;

